data/executions/run-682351f7-73d8-4fdf-a245-4f3816127914/execution.log
Picked up JAVA_TOOL_OPTIONS: -XX:+UseG1GC -Xms32m -Xmx160m -XX:MaxMetaspaceSize=128m
Jul 16, 2026 4:53:42 PM java.util.prefs.FileSystemPreferences$1 run
INFO: Created user preferences directory.
Simulation bci.cards.simulation.PublicMockSimulation started...

========================================================================================================================
2026-07-16 16:53:49 GMT                                                                               5s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         3 |         3 |         0
> Public mock GET                                                                    |         3 |         3 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||]     0%
          waiting:         0 / active:         1  / done:         0
========================================================================================================================


========================================================================================================================
2026-07-16 16:53:54 GMT                                                                              10s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         3 |         3 |         0
> Public mock GET                                                                    |         3 |         3 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||]     0%
          waiting:         0 / active:         1  / done:         0
========================================================================================================================


========================================================================================================================
2026-07-16 16:53:59 GMT                                                                              15s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         3 |         3 |         0
> Public mock GET                                                                    |         3 |         3 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||]     0%
          waiting:         0 / active:         1  / done:         0
========================================================================================================================


========================================================================================================================
2026-07-16 16:54:04 GMT                                                                              20s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         3 |         3 |         0
> Public mock GET                                                                    |         3 |         3 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||]     0%
          waiting:         0 / active:         1  / done:         0
========================================================================================================================


========================================================================================================================
2026-07-16 16:54:09 GMT                                                                              25s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         3 |         3 |         0
> Public mock GET                                                                    |         3 |         3 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||]     0%
          waiting:         0 / active:         1  / done:         0
========================================================================================================================


========================================================================================================================
2026-07-16 16:54:09 GMT                                                                              25s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         4 |         4 |         0
> Public mock GET                                                                    |         4 |         4 |         0

---- Public Mock Smoke -------------------------------------------------------------------------------------------------
[###############################################################################################################]   100%
          waiting:         0 / active:         0  / done:         1
========================================================================================================================

Parsing log file(s)...
Parsing log file(s) done in 0s.
Generating reports...

========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |         4 |         4 |         -
> min response time (ms)                                                             |       141 |       141 |         -
> max response time (ms)                                                             |    21,463 |    21,463 |         -
> mean response time (ms)                                                            |     5,632 |     5,632 |         -
> response time std deviation (ms)                                                   |     9,142 |     9,142 |         -
> response time 50th percentile (ms)                                                 |       579 |       579 |         -
> response time 75th percentile (ms)                                                 |    21,463 |    21,463 |         -
> response time 95th percentile (ms)                                                 |    21,463 |    21,463 |         -
> response time 99th percentile (ms)                                                 |    21,463 |    21,463 |         -
> mean throughput (rps)                                                              |      0.15 |      0.15 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                              3    (75%)
> OK: 800 ms <= t < 1200 ms                                                                                   0     (0%)
> OK: t >= 1200 ms                                                                                            1    (25%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Reports generated, please open the following file: file:///app/data/executions/run-682351f7-73d8-4fdf-a245-4f3816127914/results/publicmocksimulation-20260716165343808/index.html
Global: percentage of failed events is less than or equal to 1.0 : true (actual : 0.0)